src/main/test/supply-chain/3-Calculation/0-Apply Tax/3-Tax Type/2-TC02.02.03_19_Tax Type - no returned value    (New added test cases for Regression TC completion)/8-ST_PTE_TC02.02.03_19_Tax Type - no returned value-1_ApplyZero_TRT-overwrite/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax><!--Optional:-->
         <arg0><DocumentId>
        <SystemSourceId>ICI001</SystemSourceId>
    </DocumentId>
    <AlternateDocumentId>
        <CustomField1>60934129</CustomField1>
        <CustomField2>5100-G-INV-0</CustomField2>
        <CustomField3>1</CustomField3>
        <CustomField4>945-CDC-T_ABI2_E6/1</CustomField4>
        <CustomField5>ROOT:Y/PA035:N/PA059:N/RES_CnorReg</CustomField5>
        <CustomField10>TESTSTAT</CustomField10>
    </AlternateDocumentId>
    <InvoiceLanguage>
        <LanguageCode>en</LanguageCode>
        <LanguageCountryCode>GB</LanguageCountryCode>
    </InvoiceLanguage>
    <CommunicationLanguage>
        <LanguageCode>en</LanguageCode>
        <LanguageCountryCode>GB</LanguageCountryCode>
    </CommunicationLanguage>
    <CalculationDecimalPlaces>5</CalculationDecimalPlaces>
    <PreviousInvoiceTaxCountry>US</PreviousInvoiceTaxCountry>
    <TaxDecisionSet>
        <SellerTaxIndicator>
            <TaxIndicatorAbbreviation/>
            <TaxIndicatorName/>
            <TaxIndicatorComment/>
        </SellerTaxIndicator>
        <BuyerTaxIndicator>
            <TaxIndicatorAbbreviation/>
            <TaxIndicatorName/>
            <TaxIndicatorComment/>
        </BuyerTaxIndicator>
        <InvoiceCurrency>
            <CurrencyCode>EUR</CurrencyCode>
        </InvoiceCurrency>
        <TaxInvoiceLine>
            <LineNumber>115.1</LineNumber>
            <ItemNo>20278167</ItemNo>
            <ItemType>ART</ItemType>
            <UNSPSC>56000000</UNSPSC>
            <NetAmount>800.00</NetAmount>
        </TaxInvoiceLine>
        <TaxInvoiceLine>
            <LineNumber>116.1</LineNumber>
            <ItemNo>00272208</ItemNo>
            <ItemType>ART</ItemType>
            <UNSPSC>56000000</UNSPSC>
            <NetAmount>100.00</NetAmount>
        </TaxInvoiceLine>
        <TaxInvoiceLine>
            <LineNumber>117.1</LineNumber>
            <ItemNo>30063265</ItemNo>
            <ItemType>ART</ItemType>
            <UNSPSC>56000000</UNSPSC>
            <NetAmount>100.00</NetAmount>
        </TaxInvoiceLine>
     
    </TaxDecisionSet>
    <TaxDate>
        <TaxAlgorithmDate>2017-06-28</TaxAlgorithmDate>
        <TaxCalculationDate>2017-06-28</TaxCalculationDate>
    </TaxDate>
    <TaxModuleBehaviour>
        <SkipCalculation>N</SkipCalculation>
        <SkipDecision>N</SkipDecision>
    </TaxModuleBehaviour>
    <VariableTaxSteeringInput>
        <ConsignorCountry>US</ConsignorCountry>
        <ConsignorState>USCA</ConsignorState>
        <ConsignorBusinessUnitCode>945</ConsignorBusinessUnitCode>
        <ConsignorBusinessUnitType>CDC</ConsignorBusinessUnitType>
        <ConsigneeCountry>US</ConsigneeCountry>
        <ConsigneeState>USMD</ConsigneeState>
        <ConsigneeBusinessUnitCode>159</ConsigneeBusinessUnitCode>
        <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
        <ResalePurpose>Y</ResalePurpose>
        <IsOutBonded>N</IsOutBonded>
        <IsInBonded>N</IsInBonded>
        <TaxPreAlgorithmOutput>
            <IsExport>N</IsExport>
            <IsImport>N</IsImport>
            <IsExported>N</IsExported>
            <IsImported>N</IsImported>
        </TaxPreAlgorithmOutput>
    </VariableTaxSteeringInput>
    <BuyerParty>
        <Party>
            <BusinessUnitCode>5100</BusinessUnitCode>
            <BusinessUnitType>COM</BusinessUnitType>
            <BusinessUnitName>IKEA Supply AG</BusinessUnitName>
            <PartyAddress>
                <AddressType>MAIN</AddressType>
                <City>Pratteln</City>
                <Street>Grössenweg 15</Street>
                <ZipCode>4133</ZipCode>
                <CountryCode>CH</CountryCode>
            </PartyAddress>
        </Party>
    </BuyerParty>
    <SellerParty>
        <Party>
            <BusinessUnitCode>5100</BusinessUnitCode>
            <BusinessUnitType>COM</BusinessUnitType>
            <BusinessUnitName>IKEA Supply AG</BusinessUnitName>
            <PartyAddress>
                <AddressType>MAIN</AddressType>
                <City>Pratteln</City>
                <Street>Grössenweg 15</Street>
                <ZipCode>4133</ZipCode>
                <CountryCode>CH</CountryCode>
            </PartyAddress>
        </Party>
    </SellerParty>
    <TermOfDelivery>CFR</TermOfDelivery>

</arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>